# IFCParameter Template Find By Name Method

Source: https://www.revitapidocs.com/2026/6530fe2a-a82c-fb84-bb16-144e99ac1429.htm

---

| IFCParameter Template Find By Name Method |
| --- |

Returns mapping template element by name.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IFCParameterTemplate FindByName(
	Document document,
	string name
)
```

```
Public Shared Function FindByName (
	document As Document,
	name As String
) As IFCParameterTemplate
```

```
public:
static IFCParameterTemplate^ FindByName(
	Document^ document,
	String^ name
)
```

```
static member FindByName :
        document : Document *
        name : string -> IFCParameterTemplate
```

#### Parameters

document Document
:   The document to find the mapping template with the specified name.

name String
:   Name of the mapping template to find.

#### Return Value

IFCParameterTemplate
The mapping template element, or if not found. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace